results/linux/cached_low.txt
Running 1m test @ http://localhost:3000/cached
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.779ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.782ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.778ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.783ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   799.18us  379.07us   5.34ms   66.70%
    Req/Sec   533.84    105.73   800.00     61.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  797.00us
 75.000%    1.07ms
 90.000%    1.28ms
 99.000%    1.62ms
 99.900%    2.40ms
 99.990%    4.22ms
 99.999%    5.01ms
100.000%    5.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            1         1.00
       0.294     0.100000        10004         1.11
       0.451     0.200000        19986         1.25
       0.573     0.300000        30017         1.43
       0.684     0.400000        39969         1.67
       0.797     0.500000        49947         2.00
       0.857     0.550000        55006         2.22
       0.915     0.600000        60026         2.50
       0.970     0.650000        64955         2.86
       1.023     0.700000        69972         3.33
       1.072     0.750000        74995         4.00
       1.097     0.775000        77468         4.44
       1.123     0.800000        79945         5.00
       1.153     0.825000        82442         5.71
       1.188     0.850000        84926         6.67
       1.233     0.875000        87435         8.00
       1.257     0.887500        88643         8.89
       1.285     0.900000        89932        10.00
       1.311     0.912500        91142        11.43
       1.341     0.925000        92387        13.33
       1.373     0.937500        93643        16.00
       1.390     0.943750        94272        17.78
       1.408     0.950000        94902        20.00
       1.428     0.956250        95530        22.86
       1.448     0.962500        96158        26.67
       1.471     0.968750        96772        32.00
       1.483     0.971875        97087        35.56
       1.498     0.975000        97392        40.00
       1.514     0.978125        97702        45.71
       1.535     0.981250        98022        53.33
       1.559     0.984375        98316        64.00
       1.572     0.985938        98475        71.11
       1.589     0.987500        98630        80.00
       1.606     0.989062        98784        91.43
       1.627     0.990625        98942       106.67
       1.655     0.992188        99098       128.00
       1.670     0.992969        99177       142.22
       1.685     0.993750        99253       160.00
       1.703     0.994531        99330       182.86
       1.727     0.995313        99414       213.33
       1.752     0.996094        99489       256.00
       1.770     0.996484        99528       284.44
       1.783     0.996875        99565       320.00
       1.817     0.997266        99603       365.71
       1.851     0.997656        99642       426.67
       1.921     0.998047        99683       512.00
       1.956     0.998242        99701       568.89
       2.014     0.998437        99720       640.00
       2.125     0.998633        99741       731.43
       2.255     0.998828        99759       853.33
       2.431     0.999023        99779      1024.00
       2.559     0.999121        99789      1137.78
       2.675     0.999219        99798      1280.00
       2.845     0.999316        99808      1462.86
       3.007     0.999414        99818      1706.67
       3.251     0.999512        99828      2048.00
       3.281     0.999561        99833      2275.56
       3.351     0.999609        99837      2560.00
       3.453     0.999658        99842      2925.71
       3.489     0.999707        99847      3413.33
       3.685     0.999756        99852      4096.00
       3.761     0.999780        99855      4551.11
       3.771     0.999805        99857      5120.00
       3.801     0.999829        99859      5851.43
       4.027     0.999854        99862      6826.67
       4.081     0.999878        99864      8192.00
       4.223     0.999890        99866      9102.22
       4.259     0.999902        99867     10240.00
       4.367     0.999915        99868     11702.86
       4.451     0.999927        99869     13653.33
       4.467     0.999939        99870     16384.00
       4.539     0.999945        99871     18204.44
       4.791     0.999951        99872     20480.00
       4.791     0.999957        99872     23405.71
       4.891     0.999963        99873     27306.67
       4.891     0.999969        99873     32768.00
       4.923     0.999973        99874     36408.89
       4.923     0.999976        99874     40960.00
       4.923     0.999979        99874     46811.43
       5.015     0.999982        99875     54613.33
       5.015     0.999985        99875     65536.00
       5.015     0.999986        99875     72817.78
       5.015     0.999988        99875     81920.00
       5.015     0.999989        99875     93622.86
       5.343     0.999991        99876    109226.67
       5.343     1.000000        99876          inf
#[Mean    =        0.799, StdDeviation   =        0.379]
#[Max     =        5.340, Total count    =        99876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119968 requests in 1.00m, 16.02MB read
Requests/sec:   1999.43
Transfer/sec:    273.36KB