results/linux/compute_high.txt
Running 1m test @ http://localhost:3000/compute
  8 threads and 500 connections
  Thread calibration: mean lat.: 0.814ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.809ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.813ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.108ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.817ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.815ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.812ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.812ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88ms  422.70us   6.09ms   65.69%
    Req/Sec     1.34k     0.95k    6.89k    87.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88ms
 75.000%    1.16ms
 90.000%    1.43ms
 99.000%    1.86ms
 99.900%    2.24ms
 99.990%    4.09ms
 99.999%    5.70ms
100.000%    6.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.302     0.100000        49797         1.11
       0.477     0.200000        99432         1.25
       0.626     0.300000       149104         1.43
       0.759     0.400000       198879         1.67
       0.881     0.500000       248583         2.00
       0.939     0.550000       273450         2.22
       0.996     0.600000       298598         2.50
       1.051     0.650000       323404         2.86
       1.105     0.700000       348174         3.33
       1.162     0.750000       373026         4.00
       1.193     0.775000       385289         4.44
       1.229     0.800000       397624         5.00
       1.271     0.825000       410240         5.71
       1.317     0.850000       422470         6.67
       1.370     0.875000       434942         8.00
       1.398     0.887500       441058         8.89
       1.429     0.900000       447390        10.00
       1.460     0.912500       453472        11.43
       1.494     0.925000       459665        13.33
       1.532     0.937500       465916        16.00
       1.553     0.943750       469039        17.78
       1.576     0.950000       472075        20.00
       1.602     0.956250       475269        22.86
       1.630     0.962500       478373        26.67
       1.662     0.968750       481421        32.00
       1.681     0.971875       482996        35.56
       1.701     0.975000       484517        40.00
       1.724     0.978125       486073        45.71
       1.750     0.981250       487619        53.33
       1.782     0.984375       489186        64.00
       1.801     0.985938       489968        71.11
       1.821     0.987500       490709        80.00
       1.844     0.989062       491481        91.43
       1.870     0.990625       492276       106.67
       1.898     0.992188       493045       128.00
       1.913     0.992969       493423       142.22
       1.931     0.993750       493827       160.00
       1.950     0.994531       494208       182.86
       1.971     0.995313       494588       213.33
       1.996     0.996094       494975       256.00
       2.011     0.996484       495178       284.44
       2.031     0.996875       495374       320.00
       2.049     0.997266       495568       365.71
       2.071     0.997656       495759       426.67
       2.101     0.998047       495948       512.00
       2.121     0.998242       496049       568.89
       2.141     0.998437       496142       640.00
       2.165     0.998633       496241       731.43
       2.195     0.998828       496337       853.33
       2.249     0.999023       496435      1024.00
       2.287     0.999121       496483      1137.78
       2.339     0.999219       496530      1280.00
       2.397     0.999316       496577      1462.86
       2.467     0.999414       496625      1706.67
       2.585     0.999512       496674      2048.00
       2.687     0.999561       496698      2275.56
       2.765     0.999609       496722      2560.00
       2.899     0.999658       496747      2925.71
       3.015     0.999707       496771      3413.33
       3.185     0.999756       496795      4096.00
       3.241     0.999780       496807      4551.11
       3.337     0.999805       496819      5120.00
       3.409     0.999829       496832      5851.43
       3.549     0.999854       496844      6826.67
       3.743     0.999878       496856      8192.00
       3.941     0.999890       496862      9102.22
       4.131     0.999902       496868     10240.00
       4.255     0.999915       496874     11702.86
       4.451     0.999927       496880     13653.33
       4.611     0.999939       496887     16384.00
       4.639     0.999945       496889     18204.44
       4.703     0.999951       496892     20480.00
       4.767     0.999957       496895     23405.71
       4.827     0.999963       496898     27306.67
       5.155     0.999969       496901     32768.00
       5.163     0.999973       496903     36408.89
       5.175     0.999976       496904     40960.00
       5.343     0.999979       496906     46811.43
       5.355     0.999982       496907     54613.33
       5.571     0.999985       496909     65536.00
       5.591     0.999986       496910     72817.78
       5.591     0.999988       496910     81920.00
       5.695     0.999989       496911     93622.86
       5.699     0.999991       496912    109226.67
       5.763     0.999992       496913    131072.00
       5.763     0.999993       496913    145635.56
       5.763     0.999994       496913    163840.00
       5.839     0.999995       496914    187245.71
       5.839     0.999995       496914    218453.33
       5.931     0.999996       496915    262144.00
       5.931     0.999997       496915    291271.11
       5.931     0.999997       496915    327680.00
       5.931     0.999997       496915    374491.43
       5.931     0.999998       496915    436906.67
       6.095     0.999998       496916    524288.00
       6.095     1.000000       496916          inf
#[Mean    =        0.876, StdDeviation   =        0.423]
#[Max     =        6.092, Total count    =       496916]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597688 requests in 1.00m, 72.96MB read
Requests/sec:   9957.26
Transfer/sec:      1.22MB